Backbone Practice/NewsReader-master/app/controllers/api/feeds_controller.rb

  def destroy
    feed = Feed.find(params[:id])
    feed.destroy!
---
SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "6"]]
DELETE FROM "feeds" WHERE "feeds"."id" = $1  [["id", 6]]